# MySQL with Python

In [35]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [36]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print("MySQL Database connection succesfull")
    except Error as err:
        print(f"Error: '{err}'")
    return connection
pw = "1507"
db = "mysql_python"
connection = create_server_connection("localhost","root",pw)

MySQL Database connection succesfull

In [10]:
# Create mysql_python
def create_database(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created succesfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "CREATE DATABASE mysql_python"
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [37]:
# Connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password,
            database = db_name
        )
        print("MySQL Database connection successfull")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [38]:
# Execute SQL Queries
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was Successfull")
    except Error as err:
        print(f"Error: '{err}'")

In [39]:
create_orders_table = """
CREATE TABLE orders(
order_id INT PRIMARY KEY,
custommer_name VARCHAR(30) NOT NULL,
product_name VARCHAR(20) NOT NULL,
date_ordered DATE,
quantity INT,
unit_price FLOAT,
phone_number VARCHAR(20));
"""
#connect to the Database
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection, create_orders_table)

MySQL Database connection successfull
Error: '1050 (42S01): Table 'orders' already exists'

In [42]:
# Insert data
data_orders = """
INSERT INTO orders VALUES 
(101,'Anshiii','Laptop','2023-06-12',1,200,'458756895'),
(102,'Anshily','Mouse','2023-05-12',1,200,'133416895'),
(103,'Anshika','Keyboard','2023-09-12',1,200,'673482895'),
(104,'Anushika','USB','2023-11-12',1,200,'483726495'),
(105,'Anisha','Laptop','2023-03-12',1,200,'457484593');
"""
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection, data_orders)

MySQL Database connection successfull
Error: '1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY''

In [43]:
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result 
    except Error as err:
        print(f"Error: '{err}'")

In [44]:
# using the select stmt
q1 = """
SELECT * FROM orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q1)
for result in results:
    print(result)

MySQL Database connection successfull
(101, 'Anshiii', 'Laptop', datetime.date(2023, 6, 12), 1, 200.0, '458756895')
(102, 'Anshily', 'Mouse', datetime.date(2023, 5, 12), 1, 200.0, '133416895')
(103, 'Anshika', 'Keyboard', datetime.date(2023, 9, 12), 1, 200.0, '673482895')
(104, 'Anushika', 'USB', datetime.date(2023, 11, 12), 1, 200.0, '483726495')
(105, 'Anisha', 'Laptop', datetime.date(2023, 3, 12), 1, 200.0, '457484593')

In [45]:
q2 = """
SELECT custommer_name, phone_number FROM orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q2)
for result in results:
    print(result)

MySQL Database connection successfull
('Anshiii', '458756895')
('Anshily', '133416895')
('Anshika', '673482895')
('Anushika', '483726495')
('Anisha', '457484593')

In [46]:
q3 = """
SELECT year(date_ordered) FROM orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q3)
for result in results:
    print(result)

MySQL Database connection successfull
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)

In [47]:
q4 = """
SELECT DISTINCT year(date_ordered) FROM orders;
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q4)
for result in results:
    print(result)

MySQL Database connection successfull
(2023,)

In [48]:
q5 = """
SELECT * FROM orders WHERE date_ordered  < '2023-06-12'
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q5)
for result in results:
    print(result)

MySQL Database connection successfull
(102, 'Anshily', 'Mouse', datetime.date(2023, 5, 12), 1, 200.0, '133416895')
(105, 'Anisha', 'Laptop', datetime.date(2023, 3, 12), 1, 200.0, '457484593')

In [49]:
q6 = """
SELECT * FROM orders WHERE date_ordered  < '2023-06-12'
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q6)
for result in results:
    print(result)

MySQL Database connection successfull
(102, 'Anshily', 'Mouse', datetime.date(2023, 5, 12), 1, 200.0, '133416895')
(105, 'Anisha', 'Laptop', datetime.date(2023, 3, 12), 1, 200.0, '457484593')

In [50]:
q7 = """
SELECT * FROM orders ORDER BY unit_price DESC;
"""
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,q7)
for result in results:
    print(result)

MySQL Database connection successfull
(101, 'Anshiii', 'Laptop', datetime.date(2023, 6, 12), 1, 200.0, '458756895')
(102, 'Anshily', 'Mouse', datetime.date(2023, 5, 12), 1, 200.0, '133416895')
(103, 'Anshika', 'Keyboard', datetime.date(2023, 9, 12), 1, 200.0, '673482895')
(104, 'Anushika', 'USB', datetime.date(2023, 11, 12), 1, 200.0, '483726495')
(105, 'Anisha', 'Laptop', datetime.date(2023, 3, 12), 1, 200.0, '457484593')

In [51]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ["oredered_id","customer_name","product_name", "date_ordered", "quantity", "unit_price","phone_number"]
df = pd.DataFrame(from_db, columns = columns)
display(df)

,oredered_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Anshiii,Laptop,2023-06-12,1,200.0,458756895
1,102,Anshily,Mouse,2023-05-12,1,200.0,133416895
2,103,Anshika,Keyboard,2023-09-12,1,200.0,673482895
3,104,Anushika,USB,2023-11-12,1,200.0,483726495
4,105,Anisha,Laptop,2023-03-12,1,200.0,457484593